In [1]:
import pandas as pd

countries = pd.read_csv("countries.csv", usecols=['Symbol','Name'],index_col='Symbol').squeeze()
countries.dropna(inplace=True)
countries.head(20)

Symbol
AF            Afghanistan
AL                Albania
DZ                Algeria
AD                Andorra
AO                 Angola
AI               Anguilla
AQ             Antarctica
AG    Antigua and Barbuda
SA           Saudi Arabia
AR              Argentina
AM                Armenia
AW                  Aruba
AU              Australia
AT                Austria
AZ             Azerbaijan
BS                Bahamas
BH                Bahrain
BD             Bangladesh
BB               Barbados
BE                Belgium
Name: Name, dtype: object

In [2]:
toFind = ['BB', 'AA', 'BS']

In [3]:
# countries.loc[toFind] - wyrzuca KeyError

In [4]:
countries.reindex(toFind)

Symbol
BB    Barbados
AA         NaN
BS     Bahamas
Name: Name, dtype: object

In [5]:
countries.index.intersection(toFind)

Index(['BS', 'BB'], dtype='object', name='Symbol')

In [6]:
countries.loc[countries.index.intersection(toFind)]

Symbol
BS     Bahamas
BB    Barbados
Name: Name, dtype: object